OpenFOAM/thermofluid/tutorials/deprecatedTutorials/marangoni/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
12000
(
0.995
0.985
0.975
0.965
0.955
0.945
0.935
0.925
...
)
;

boundaryField
{
    leftWall
    {
        type            fixedValue;
	value		uniform 1.0;
    }
    rightWall
    {
        type            fixedValue;
	value		uniform 0.0;
    }
    topAndBottomWalls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
