OpenFOAM/thermofluid/tutorials/deprecatedTutorials/marangoni/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  none;

noRadiation
{
}

P1Coeffs
{
}

fvDOMCoeffs
{
    nPhi    4;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta  2;          // polar angles in PI (from Z to X-Y plane)
    convergence 1e-3;   // convergence criteria for radiation iteration
    maxIter 20;          // maximum number of iterations
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel constantAbsorptionEmission;

multiPhaseConstantAbsorptionEmissionCoeffs
{
    aS               aS [ 0 -1 0 0 0 0 0 ] 0.0;
    aL               aL [ 0 -1 0 0 0 0 0 ] 0.01;
    aG               aG [ 0 -1 0 0 0 0 0 ] 0.0;
    eS               eS [ 0 -1 0 0 0 0 0 ] 0;
    eL               eL [ 0 -1 0 0 0 0 0 ] 0;
    eG               eG [ 0 -1 0 0 0 0 0 ] 0;
    E               E [ 1 -1 -3 0 0 0 0 ] 0;
}

constantAbsorptionEmissionCoeffs
{
    a              a [ 0 -1 0 0 0 0 0 ] 0.01;
    e              e [ 0 -1 0 0 0 0 0 ] 0.0;
    E               E [ 1 -1 -3 0 0 0 0 ] 0;
}

scatterModel    constantScatter;

constantScatterCoeffs
{
    sigma           sigma [ 0 -1 0 0 0 0 0 ] 0;
    C               C [ 0 0 0 0 0 0 0 ] 0;
}


// ************************************************************************* //
