OpenFOAM/thermofluid/tutorials/deprecatedTutorials/marangoni/constant/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	C		  C [ 1 -3 -1 0 0 0 0 ] 160.0; 

    	betaL             betaL [ 0 0 0 -1 0 0 0 ] 0.0; //1e-3;
	betaG             betaG [ 0 0 0 -1 0 0 0 ] 0.0; //1e-3;
    	betaM             betaS [ 0 0 0 -1 0 0 0 ] 0.0; //1e-3;

	TRef          	   TRef [ 0 0 0 1 0 0 0 ]    0.0;
	Tl                Tl     [ 0 0 0 1 0 0 0 ]   0.0;
	Ts                Ts     [ 0 0 0 1 0 0 0 ]   -1.0;
	Hf                1.0; // St = 1.0

// ************************************************************************* //
