OpenFOAM/thermofluid/tutorials/deprecatedTutorials/marangoni/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {}
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    pd
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
    }

    pdFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
    }

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
    }
    
    T
    {
	solver		BiCGStab;
	preconditioner	DILU;
	tolerance	1e-10;
	reTol		0.001;
    }
}

PISO
{
    cAlpha          1;
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors    10;
    nCorrectors    	20;
    nNonOrthogonalCorrectors 0;
    nAlphaCorr      2;
    nAlphaSubCycles 3;
    nTCorrectors    500;
    pdRefCell        0;
    pdRefValue       0;
    pRefValue       0;

    residualControl
        {
            "U"
            {
                tolerance    1e-7;
                relTol        0;
            }
            "pd"
            {
                tolerance    1e-6;
                relTol        0;
            }

	    "T"
	    {
		tolerance    1e-10;
		relTol       0;
	    }

	    "temperatureTol"
	    {
		tolerance	1e-10;
		relTol		0;
	    }
        }
}

Controls
{
    relaxCorr    0.6;
}

relaxationFactors
  {
      fields
      {
          pd              0.3;
      }
      equations
      {
          U               0.8;
          T               0.7;
      }
  }


// ************************************************************************* //
