OpenFOAM/thermofluid/tutorials/deprecatedTutorials/marangoni/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.material 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (1.0 0.1 0.2);
        fieldValues
        (
            volScalarFieldValue alpha.material 1
        );
    }
);


// ************************************************************************* //
